<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Category;

class CategorySeeder extends Seeder
{
    public function run(): void
    {
        $categories = [
            "Фризерски и козметички услуги" => [
                "Берберница", "Женски салон", "Козметички салон", "Фитнес центар", "Спа центар", "Масажа", "Фризер"
            ],
            "Здравје и медицина" => [
                "Стоматолог", "Ветеринар", "Фармацевт"
            ],
            "Автомобили и транспорт" => [
                "Автомеханичар", "Автосервис", "Такси услуги", "Автобуски превоз"
            ],
            "Мајсторски и технички услуги" => [
                "Мајсторски услуги", "Сантехничар", "Електричар", "Водоводџија", "Климатици и греење",
                "Поправка на апарати", "Трговија со алати", "Дрвени работи", "Метални работи",
                "Сантехника", "Стапарски услуги", "Зидарски услуги", "Фасадни работи"
            ],
            "Храна и угостителство" => [
                "Ресторан", "Кафуле", "Пекара", "Бар", "Кафеана"
            ],
            "Услуги за домување и недвижности" => [
                "Надзор и обезбедување", "Чистење и хигиена", "Декорација и ентериер", "Непокретности"
            ],
            "Образование и забава" => [
                "Образование и курсеви", "Детска забава", "Туристички услуги"
            ],
            "Freelance / дигитални услуги" => [
                "Freelance", "Дизајн", "Програмирање", "Маркетинг", "Копирајтинг"
            ],
            "Друго" => ["Друго"]
        ];

        foreach ($categories as $main => $subs) {
            $parent = Category::create(['name' => $main]);

            foreach ($subs as $sub) {
                Category::create([
                    'name' => $sub,
                    'parent_id' => $parent->id
                ]);
            }
        }
    }
}
